7767517
111 123
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 335 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864
PReLU            PRelu_2                  1 1 335 338 0=32
ConvolutionDepthWise Conv_3                   1 1 338 339 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
PReLU            PRelu_5                  1 1 339 342 0=32
Convolution      Conv_6                   1 1 342 343 0=103 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3296
PReLU            PRelu_8                  1 1 343 346 0=103
ConvolutionDepthWise Conv_9                   1 1 346 347 0=103 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=927 7=103
PReLU            PRelu_11                 1 1 347 350 0=103
Convolution      Conv_12                  1 1 350 351 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6592
Split            splitncnn_0              1 2 351 351_splitncnn_0 351_splitncnn_1
Convolution      Conv_14                  1 1 351_splitncnn_1 353 0=13 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
PReLU            PRelu_16                 1 1 353 356 0=13
ConvolutionDepthWise Conv_17                  1 1 356 357 0=13 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=117 7=13
PReLU            PRelu_19                 1 1 357 360 0=13
Convolution      Conv_20                  1 1 360 361 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
BinaryOp         Add_22                   2 1 351_splitncnn_0 361 363 0=0
Split            splitncnn_1              1 2 363 363_splitncnn_0 363_splitncnn_1
Convolution      Conv_23                  1 1 363_splitncnn_1 364 0=13 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
PReLU            PRelu_25                 1 1 364 367 0=13
ConvolutionDepthWise Conv_26                  1 1 367 368 0=13 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=117 7=13
PReLU            PRelu_28                 1 1 368 371 0=13
Convolution      Conv_29                  1 1 371 372 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
BinaryOp         Add_31                   2 1 363_splitncnn_0 372 374 0=0
Split            splitncnn_2              1 2 374 374_splitncnn_0 374_splitncnn_1
Convolution      Conv_32                  1 1 374_splitncnn_1 375 0=13 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
PReLU            PRelu_34                 1 1 375 378 0=13
ConvolutionDepthWise Conv_35                  1 1 378 379 0=13 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=117 7=13
PReLU            PRelu_37                 1 1 379 382 0=13
Convolution      Conv_38                  1 1 382 383 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
BinaryOp         Add_40                   2 1 374_splitncnn_0 383 385 0=0
Split            splitncnn_3              1 2 385 385_splitncnn_0 385_splitncnn_1
Convolution      Conv_41                  1 1 385_splitncnn_1 386 0=13 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
PReLU            PRelu_43                 1 1 386 389 0=13
ConvolutionDepthWise Conv_44                  1 1 389 390 0=13 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=117 7=13
PReLU            PRelu_46                 1 1 390 393 0=13
Convolution      Conv_47                  1 1 393 394 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
BinaryOp         Add_49                   2 1 385_splitncnn_0 394 396 0=0
Convolution      Conv_50                  1 1 396 397 0=231 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14784
PReLU            PRelu_52                 1 1 397 400 0=231
ConvolutionDepthWise Conv_53                  1 1 400 401 0=231 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2079 7=231
PReLU            PRelu_55                 1 1 401 404 0=231
Convolution      Conv_56                  1 1 404 405 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=29568
Split            splitncnn_4              1 2 405 405_splitncnn_0 405_splitncnn_1
Convolution      Conv_58                  1 1 405_splitncnn_1 407 0=231 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=29568
PReLU            PRelu_60                 1 1 407 410 0=231
ConvolutionDepthWise Conv_61                  1 1 410 411 0=231 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2079 7=231
PReLU            PRelu_63                 1 1 411 414 0=231
Convolution      Conv_64                  1 1 414 415 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=29568
BinaryOp         Add_66                   2 1 405_splitncnn_0 415 417 0=0
Split            splitncnn_5              1 2 417 417_splitncnn_0 417_splitncnn_1
Convolution      Conv_67                  1 1 417_splitncnn_1 418 0=52 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6656
PReLU            PRelu_69                 1 1 418 421 0=52
ConvolutionDepthWise Conv_70                  1 1 421 422 0=52 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=468 7=52
PReLU            PRelu_72                 1 1 422 425 0=52
Convolution      Conv_73                  1 1 425 426 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6656
BinaryOp         Add_75                   2 1 417_splitncnn_0 426 428 0=0
Split            splitncnn_6              1 2 428 428_splitncnn_0 428_splitncnn_1
Convolution      Conv_76                  1 1 428_splitncnn_1 429 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_78                 1 1 429 432 0=26
ConvolutionDepthWise Conv_79                  1 1 432 433 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_81                 1 1 433 436 0=26
Convolution      Conv_82                  1 1 436 437 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_84                   2 1 428_splitncnn_0 437 439 0=0
Split            splitncnn_7              1 2 439 439_splitncnn_0 439_splitncnn_1
Convolution      Conv_85                  1 1 439_splitncnn_1 440 0=77 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9856
PReLU            PRelu_87                 1 1 440 443 0=77
ConvolutionDepthWise Conv_88                  1 1 443 444 0=77 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=693 7=77
PReLU            PRelu_90                 1 1 444 447 0=77
Convolution      Conv_91                  1 1 447 448 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9856
BinaryOp         Add_93                   2 1 439_splitncnn_0 448 450 0=0
Split            splitncnn_8              1 2 450 450_splitncnn_0 450_splitncnn_1
Convolution      Conv_94                  1 1 450_splitncnn_1 451 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_96                 1 1 451 454 0=26
ConvolutionDepthWise Conv_97                  1 1 454 455 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_99                 1 1 455 458 0=26
Convolution      Conv_100                 1 1 458 459 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_102                  2 1 450_splitncnn_0 459 461 0=0
Split            splitncnn_9              1 2 461 461_splitncnn_0 461_splitncnn_1
Convolution      Conv_103                 1 1 461_splitncnn_1 462 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_105                1 1 462 465 0=26
ConvolutionDepthWise Conv_106                 1 1 465 466 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_108                1 1 466 469 0=26
Convolution      Conv_109                 1 1 469 470 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_111                  2 1 461_splitncnn_0 470 472 0=0
Convolution      Conv_112                 1 1 472 473 0=308 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=39424
PReLU            PRelu_114                1 1 473 476 0=308
ConvolutionDepthWise Conv_115                 1 1 476 477 0=308 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2772 7=308
PReLU            PRelu_117                1 1 477 480 0=308
Convolution      Conv_118                 1 1 480 481 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=39424
Split            splitncnn_10             1 2 481 481_splitncnn_0 481_splitncnn_1
Convolution      Conv_120                 1 1 481_splitncnn_1 483 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_122                1 1 483 486 0=26
ConvolutionDepthWise Conv_123                 1 1 486 487 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_125                1 1 487 490 0=26
Convolution      Conv_126                 1 1 490 491 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_128                  2 1 481_splitncnn_0 491 493 0=0
Split            splitncnn_11             1 2 493 493_splitncnn_0 493_splitncnn_1
Convolution      Conv_129                 1 1 493_splitncnn_1 494 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_131                1 1 494 497 0=26
ConvolutionDepthWise Conv_132                 1 1 497 498 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_134                1 1 498 501 0=26
Convolution      Conv_135                 1 1 501 502 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_137                  2 1 493_splitncnn_0 502 504 0=0
Convolution      Conv_138                 1 1 504 505 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
PReLU            PRelu_140                1 1 505 508 0=512
ConvolutionDepthWise Conv_141                 1 1 508 509 0=512 1=5 11=5 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800 7=512
Reshape          Reshape_148              1 1 509 518 0=-1
InnerProduct     MatMul_149               1 1 518 520 0=128 1=0 2=65536
BatchNorm        BatchNormalization_150   1 1 520 521 0=128
InnerProduct     MatMul_151               1 1 521 output 0=3 1=0 2=384