7767517
132 147
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 371 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864
PReLU            PRelu_2                  1 1 371 374 0=32
ConvolutionDepthWise Conv_3                   1 1 374 375 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
PReLU            PRelu_5                  1 1 375 378 0=32
Convolution      Conv_6                   1 1 378 379 0=103 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3296
PReLU            PRelu_8                  1 1 379 382 0=103
ConvolutionDepthWise Conv_9                   1 1 382 383 0=103 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=927 7=103
PReLU            PRelu_11                 1 1 383 386 0=103
Convolution      Conv_12                  1 1 386 387 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6592
Split            splitncnn_0              1 2 387 387_splitncnn_0 387_splitncnn_1
Convolution      Conv_14                  1 1 387_splitncnn_1 389 0=13 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
PReLU            PRelu_16                 1 1 389 392 0=13
ConvolutionDepthWise Conv_17                  1 1 392 393 0=13 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=117 7=13
PReLU            PRelu_19                 1 1 393 396 0=13
Convolution      Conv_20                  1 1 396 397 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
BinaryOp         Add_22                   2 1 387_splitncnn_0 397 399 0=0
Split            splitncnn_1              1 2 399 399_splitncnn_0 399_splitncnn_1
Convolution      Conv_23                  1 1 399_splitncnn_1 400 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1664
PReLU            PRelu_25                 1 1 400 403 0=26
ConvolutionDepthWise Conv_26                  1 1 403 404 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_28                 1 1 404 407 0=26
Convolution      Conv_29                  1 1 407 408 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1664
BinaryOp         Add_31                   2 1 399_splitncnn_0 408 410 0=0
Split            splitncnn_2              1 2 410 410_splitncnn_0 410_splitncnn_1
Convolution      Conv_32                  1 1 410_splitncnn_1 411 0=13 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
PReLU            PRelu_34                 1 1 411 414 0=13
ConvolutionDepthWise Conv_35                  1 1 414 415 0=13 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=117 7=13
PReLU            PRelu_37                 1 1 415 418 0=13
Convolution      Conv_38                  1 1 418 419 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
BinaryOp         Add_40                   2 1 410_splitncnn_0 419 421 0=0
Split            splitncnn_3              1 2 421 421_splitncnn_0 421_splitncnn_1
Convolution      Conv_41                  1 1 421_splitncnn_1 422 0=52 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_43                 1 1 422 425 0=52
ConvolutionDepthWise Conv_44                  1 1 425 426 0=52 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=468 7=52
PReLU            PRelu_46                 1 1 426 429 0=52
Convolution      Conv_47                  1 1 429 430 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
Split            splitncnn_4              1 2 430 430_splitncnn_0 430_splitncnn_1
Pooling          GlobalAveragePool_49     1 1 430_splitncnn_1 432 0=1 4=1
Convolution      Conv_50                  1 1 432 433 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             Relu_52                  1 1 433 435
Convolution      Conv_53                  1 1 435 436 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Sigmoid          Sigmoid_55               1 1 436 438
BinaryOp         Mul_56                   2 1 430_splitncnn_0 438 439 0=2
BinaryOp         Add_57                   2 1 421_splitncnn_0 439 440 0=0
Convolution      Conv_58                  1 1 440 441 0=231 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14784
PReLU            PRelu_60                 1 1 441 444 0=231
ConvolutionDepthWise Conv_61                  1 1 444 445 0=231 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2079 7=231
PReLU            PRelu_63                 1 1 445 448 0=231
Convolution      Conv_64                  1 1 448 449 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=29568
Split            splitncnn_5              1 2 449 449_splitncnn_0 449_splitncnn_1
Convolution      Conv_66                  1 1 449_splitncnn_1 451 0=154 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=19712
PReLU            PRelu_68                 1 1 451 454 0=154
ConvolutionDepthWise Conv_69                  1 1 454 455 0=154 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1386 7=154
PReLU            PRelu_71                 1 1 455 458 0=154
Convolution      Conv_72                  1 1 458 459 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=19712
BinaryOp         Add_74                   2 1 449_splitncnn_0 459 461 0=0
Split            splitncnn_6              1 2 461 461_splitncnn_0 461_splitncnn_1
Convolution      Conv_75                  1 1 461_splitncnn_1 462 0=52 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6656
PReLU            PRelu_77                 1 1 462 465 0=52
ConvolutionDepthWise Conv_78                  1 1 465 466 0=52 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=468 7=52
PReLU            PRelu_80                 1 1 466 469 0=52
Convolution      Conv_81                  1 1 469 470 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6656
BinaryOp         Add_83                   2 1 461_splitncnn_0 470 472 0=0
Split            splitncnn_7              1 2 472 472_splitncnn_0 472_splitncnn_1
Convolution      Conv_84                  1 1 472_splitncnn_1 473 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_86                 1 1 473 476 0=26
ConvolutionDepthWise Conv_87                  1 1 476 477 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_89                 1 1 477 480 0=26
Convolution      Conv_90                  1 1 480 481 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_92                   2 1 472_splitncnn_0 481 483 0=0
Split            splitncnn_8              1 2 483 483_splitncnn_0 483_splitncnn_1
Convolution      Conv_93                  1 1 483_splitncnn_1 484 0=52 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6656
PReLU            PRelu_95                 1 1 484 487 0=52
ConvolutionDepthWise Conv_96                  1 1 487 488 0=52 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=468 7=52
PReLU            PRelu_98                 1 1 488 491 0=52
Convolution      Conv_99                  1 1 491 492 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6656
BinaryOp         Add_101                  2 1 483_splitncnn_0 492 494 0=0
Split            splitncnn_9              1 2 494 494_splitncnn_0 494_splitncnn_1
Convolution      Conv_102                 1 1 494_splitncnn_1 495 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_104                1 1 495 498 0=26
ConvolutionDepthWise Conv_105                 1 1 498 499 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_107                1 1 499 502 0=26
Convolution      Conv_108                 1 1 502 503 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_110                  2 1 494_splitncnn_0 503 505 0=0
Split            splitncnn_10             1 2 505 505_splitncnn_0 505_splitncnn_1
Convolution      Conv_111                 1 1 505_splitncnn_1 506 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_113                1 1 506 509 0=26
ConvolutionDepthWise Conv_114                 1 1 509 510 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_116                1 1 510 513 0=26
Convolution      Conv_117                 1 1 513 514 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
Split            splitncnn_11             1 2 514 514_splitncnn_0 514_splitncnn_1
Pooling          GlobalAveragePool_119    1 1 514_splitncnn_1 516 0=1 4=1
Convolution      Conv_120                 1 1 516 517 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_122                 1 1 517 519
Convolution      Conv_123                 1 1 519 520 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Sigmoid          Sigmoid_125              1 1 520 522
BinaryOp         Mul_126                  2 1 514_splitncnn_0 522 523 0=2
BinaryOp         Add_127                  2 1 505_splitncnn_0 523 524 0=0
Convolution      Conv_128                 1 1 524 525 0=308 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=39424
PReLU            PRelu_130                1 1 525 528 0=308
ConvolutionDepthWise Conv_131                 1 1 528 529 0=308 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2772 7=308
PReLU            PRelu_133                1 1 529 532 0=308
Convolution      Conv_134                 1 1 532 533 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=39424
Split            splitncnn_12             1 2 533 533_splitncnn_0 533_splitncnn_1
Convolution      Conv_136                 1 1 533_splitncnn_1 535 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_138                1 1 535 538 0=26
ConvolutionDepthWise Conv_139                 1 1 538 539 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_141                1 1 539 542 0=26
Convolution      Conv_142                 1 1 542 543 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_144                  2 1 533_splitncnn_0 543 545 0=0
Split            splitncnn_13             1 2 545 545_splitncnn_0 545_splitncnn_1
Convolution      Conv_145                 1 1 545_splitncnn_1 546 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_147                1 1 546 549 0=26
ConvolutionDepthWise Conv_148                 1 1 549 550 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_150                1 1 550 553 0=26
Convolution      Conv_151                 1 1 553 554 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
Split            splitncnn_14             1 2 554 554_splitncnn_0 554_splitncnn_1
Pooling          GlobalAveragePool_153    1 1 554_splitncnn_1 556 0=1 4=1
Convolution      Conv_154                 1 1 556 557 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_156                 1 1 557 559
Convolution      Conv_157                 1 1 559 560 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Sigmoid          Sigmoid_159              1 1 560 562
BinaryOp         Mul_160                  2 1 554_splitncnn_0 562 563 0=2
BinaryOp         Add_161                  2 1 545_splitncnn_0 563 564 0=0
Convolution      Conv_162                 1 1 564 565 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
PReLU            PRelu_164                1 1 565 568 0=512
ConvolutionDepthWise Conv_165                 1 1 568 569 0=512 1=5 11=5 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800 7=512
Reshape          Reshape_172              1 1 569 578 0=-1
InnerProduct     MatMul_173               1 1 578 580 0=128 1=0 2=65536
BatchNorm        BatchNormalization_174   1 1 580 581 0=128
InnerProduct     MatMul_175               1 1 581 output 0=3 1=0 2=384
